//const fb=require('firebase/compat/app');
//require('firebase/compat/database');

quiz_data=[
	[['КАБАН',0,4,1],['БАНКА',0,1,0],['БАКАН',2,4,0],['КАБИНА',4,0,0]],
	[['БАНКА',0,3,1],['БАКЛАН',4,2,0],['БАКАН',0,7,1],['КАЛАН',1,0,0]],
	[['ГЛАВКА',0,4,1],['ГАЛКА',0,4,0],['ЛАВКА',3,2,0],['ГЛАВА',5,0,0]],
	[['ВРАТА',4,2,0],['ТРАВА',0,4,1],['ЗАВТРА',2,3,0],['АЗАРТ',0,0,0]],
	[['НАВАЛ',1,3,1],['КАНАЛ',4,0,0],['ВАЛКА',0,1,1],['АНКЛАВ',2,3,0]],
	[['ПАЛКА',0,4,1],['ВАЛКА',4,0,0],['ПЛАВКА',0,4,0],['ЛАПКА',2,4,0]],
	[['ВАЛКА',4,4,0],['САКВА',1,4,1],['СВАЛКА',0,7,1],['СЛАВА',2,0,0]],
	[['ВАТКА',3,0,0],['ТРАВА',1,4,1],['ТРАВКА',1,4,0],['КАРТА',0,9,1]],
	[['ЛАВСАН',0,4,1],['САВАН',5,0,0],['СЛАВА',3,4,0],['НАВАЛ',0,0,0]],
	[['ОПРАВА',4,2,0],['ПРАВО',0,2,1],['ОРАВА',2,0,0],['ПОВАР',0,2,0]],
	[['ВРАТА',3,4,0],['ТРАВА',0,4,1],['ОТВАР',1,0,0],['ОТРАВА',0,1,1]],
	[['ЛАНКА',0,1,0],['КАНАЛ',0,4,1],['КАЛАН',2,0,0],['КАЛГАН',4,2,0]],
	[['КАГУАН',0,4,1],['КАГАН',0,4,0],['ГАНКА',2,4,0],['НАУКА',4,0,0]],
	[['КАНАЛ',1,4,0],['НАКАЛ',0,7,1],['КАЛАН',1,4,1],['НАКЛАД',4,0,0]],
	[['МАРКА',3,5,0],['ДРАКА',1,9,1],['ДРАМА',0,5,1],['КАМРАД',0,0,0]],
	[['ДРАКА',0,1,0],['КАРДА',0,4,1],['КАРДАН',4,0,0],['РАНКА',2,4,0]],
	[['ХМАРА',0,5,1],['МАХРА',2,4,0],['ДРАМА',1,7,1],['ДХАРМА',4,0,0]],
	[['АНКЕТА',2,0,0],['ТАНКА',1,5,1],['НАКАТ',0,2,1],['КАНАТ',4,5,0]],
	[['КАТАР',0,4,0],['КАТЕР',0,4,1],['РАКЕТА',2,0,0],['КАРТА',4,2,0]],
	[['МАНЕРА',1,0,0],['АРЕНА',0,4,1],['МАНЕР',4,3,0],['МАРАН',0,1,1]],
	[['КАМСА',4,0,0],['МАСКА',0,1,1],['МАКСА',0,4,1],['СМАЗКА',0,3,0]],
	[['ПЛАЗМА',0,0,0],['ЛАМПА',0,1,1],['ЗАПАЛ',0,3,1],['АЛМАЗ',3,3,0]],
	[['ЛИАНА',2,4,0],['КАНАЛ',0,7,1],['КАЛИНА',0,4,1],['КАЛАН',4,0,0]],
	[['ПИЛКА',0,7,1],['АПИЛАК',4,3,0],['ЛАПКА',0,3,1],['КАПЛИ',0,0,0]],
	[['КАМАС',4,4,0],['СИАМКА',0,4,1],['МАСКА',2,0,0],['СААМИ',1,6,1]],
	[['КАНАЛ',0,4,0],['КАЛАН',0,4,1],['ПАЛКА',3,0,0],['КЛАПАН',0,0,1]],
	[['УЛАНКА',2,4,0],['НАУКА',0,4,1],['НАКАЛ',4,1,0],['КАЛАН',0,0,0]],
	[['ЛАСКА',4,0,0],['САПКА',0,4,1],['ПЛАКСА',2,4,0],['ПАЛКА',1,9,1]],
	[['ТАПКА',1,0,0],['ЛАПКА',0,4,1],['ПЛАКАТ',4,2,0],['ПЛАТА',0,6,1]],
	[['ЛАХТАК',5,0,0],['ХАТКА',1,4,1],['ХАЛАТ',1,4,0],['ЛАТКА',0,7,1]],
	[['КАМСА',0,3,0],['МАНКА',0,5,1],['САКМАН',2,0,0],['МАСКА',4,1,0]],
	[['КАМСА',4,3,0],['КАРМА',0,4,1],['МАСКА',0,7,1],['МАСАКР',0,0,0]],
	[['КАСТА',0,5,1],['МАСТАК',0,0,0],['КАМСА',2,2,0],['МАСКА',4,4,0]],
	[['ТАНКА',0,5,1],['КАПТАН',2,0,0],['КАНАТ',4,2,0],['ПАТАН',0,3,0]],
	[['КАРТА',4,0,0],['АКАНТ',0,3,1],['КАТАР',2,0,0],['КАТРАН',0,2,0]],
	[['ТАНКА',0,4,0],['АКАНТ',0,8,1],['ТАСКА',0,4,1],['СТАКАН',4,0,0]],
	[['НАФТА',0,4,1],['КАФТАН',1,3,0],['ТАНКА',4,0,0],['АКАНТ',0,0,1]],
	[['КАТАР',0,4,1],['КАРСТ',0,4,0],['КАРТА',3,0,0],['СТАРКА',0,7,1]],
	[['ПЛАТА',0,0,1],['ЛАПТА',1,0,0],['ОТПАЛ',0,3,1],['ЛОПАТА',4,3,0]],
	[['ПЛАТА',2,0,0],['ЛАПТА',0,0,1],['ПАТУА',0,3,1],['УПЛАТА',0,2,0]],
	[['ПТАХА',0,3,1],['ХАЛАТ',4,0,0],['ПЛАТА',0,3,0],['ПЛАХТА',2,1,0]],
	[['ТРАНС',0,3,1],['СТРАНА',2,0,0],['АСТРА',0,1,1],['ТАРАН',0,3,0]],
	[['НЕДРА',0,7,1],['БРЕНД',0,4,0],['РЕДАН',0,5,1],['БЕРДАН',4,0,0]],
	[['БОКАЛ',0,3,0],['КОДЛА',0,5,1],['ЛОДКА',4,1,0],['ОБКЛАД',2,0,0]],
	[['ЗАБОР',1,6,1],['РОЗАН',1,4,0],['БРОНЗА',0,4,1],['ОБРАЗ',4,0,0]],
	[['ОБРАЗ',1,0,1],['АБОРТ',4,0,0],['ТАБОР',0,3,1],['ТОРБАЗ',0,3,0]],
	[['НАКОЛ',0,4,1],['БАЛКОН',4,2,0],['БЛАНК',2,0,0],['ЛОБАН',0,0,1]],
	[['КОЛОБ',4,4,0],['ОБЛАКО',0,4,1],['КОЛБА',0,3,0],['БОКАЛ',2,0,0]],
	[['НАБОР',0,3,1],['КАРБОН',1,2,0],['БАРОН',3,0,0],['КОБРА',0,6,1]],
	[['РЕДОВА',3,0,0],['ДРЕВО',0,4,1],['ДРОВА',0,4,0],['ВЕДРО',0,0,1]],
	[['САДОК',4,0,0],['СВОДКА',0,4,1],['ВОДКА',0,1,1],['САДКО',0,4,0]],
	[['ВЕСНА',0,0,1],['СИНЕВА',2,0,0],['НАВЕС',0,4,1],['СИЕНА',4,4,0]],
	[['СЕТКА',0,4,0],['СЕКТА',0,4,1],['ВЕТКА',4,0,0],['ВЕСТКА',2,0,0]],
	[['ТАКСИ',2,5,0],['КСИВА',1,8,1],['АКТИВ',0,5,1],['СВИТКА',0,0,0]],
	[['ФИНВАЛ',1,0,0],['НАЛИВ',0,4,1],['ФИНАЛ',3,3,0],['ЛИВАН',0,1,1]],
	[['ВУЛКАН',0,3,0],['ВНУКА',0,3,1],['ЛУНКА',3,0,0],['КАВУН',0,6,1]],
	[['ПЛОТВА',4,0,0],['ТОЛПА',0,5,1],['АВТОЛ',2,1,0],['ОТВАЛ',0,4,0]],
	[['АВТОР',2,0,0],['ВТОРА',0,3,1],['ВОРОТА',0,3,0],['ТОВАР',0,7,1]],
	[['ТАВРО',0,5,1],['ТОВАР',4,4,0],['ХОРВАТ',0,0,0],['АВТОР',0,8,1]],
	[['АГЕНТ',2,0,0],['ЛЕНТА',0,3,1],['АНГЕЛ',0,1,1],['ЛАНГЕТ',0,3,0]],
	[['РАЗГОН',0,0,1],['ОРГАН',4,0,0],['АРГОН',0,4,1],['РОЗАН',1,4,0]],
	[['РОГОЗ',3,0,0],['ГРОЗА',0,4,1],['РОГОЗА',1,4,0],['РОЗГА',0,7,1]],
	[['ФЛАНГ',4,3,0],['ГЛИНА',0,5,1],['ФИНГАЛ',1,0,0],['ФИНАЛ',0,1,1]],
	[['ГНОМА',0,4,1],['МАНГО',4,3,0],['ИМАГО',2,0,0],['МИНОГА',0,0,0]],
	[['ОРГАН',5,0,0],['ОНАГР',1,1,1],['ГОРЛАН',0,4,1],['ЛАРГО',3,4,0]],
	[['РОТАНГ',0,4,1],['ТАНГО',1,0,0],['АРГОН',3,4,0],['ОРГАН',5,2,0]],
	[['АДРЕС',0,0,1],['СКЕРДА',4,0,0],['АСКЕР',0,3,1],['СРЕДА',1,3,0]],
	[['ДЕРМА',0,5,1],['МЕАНДР',2,0,0],['ДРЕМА',0,1,1],['МАНЕР',4,4,0]],
	[['ДЕСАНТ',0,4,0],['СТЕНД',0,6,1],['ДЕСНА',0,4,1],['СТЕНА',4,0,0]],
	[['РОДИНА',2,0,0],['РАДОН',0,2,1],['НАДИР',1,5,1],['РАДИО',5,5,0]],
	[['ЛОДКА',0,4,1],['ОКЛАД',2,0,0],['КОДЛА',4,0,0],['КОЛЯДА',0,2,0]],
	[['ПОДСАК',0,4,0],['ПОСАД',0,4,1],['СОПКА',0,7,1],['ДОСКА',3,0,0]],
	[['НАРЯД',0,5,1],['РЯСНА',0,2,0],['АДРЯС',2,3,0],['СНАРЯД',4,0,0]],
	[['НАЛЕП',0,0,1],['ПЕЛЕНА',4,0,0],['ПЛЕНА',0,5,1],['ПЕНАЛ',0,5,0]],
	[['МАЗЕР',0,4,1],['РАЗМЕН',2,2,0],['ЗАМЕР',0,2,0],['МАНЕР',4,0,0]],
	[['ЗАМЕР',5,2,0],['ПРАЗЕМ',0,4,1],['ПАРЕЗ',3,0,0],['ПЕМЗА',0,4,0]],
	[['МАЗЕР',4,0,0],['МУАРЕ',0,3,1],['РАЗУМ',0,0,1],['МАУЗЕР',2,2,0]],
	[['РОЗАН',0,3,0],['РЕЗОН',0,3,1],['ЗЕРНО',2,3,0],['РАЗНОЕ',4,0,0]],
	[['ОКЕАН',0,9,1],['ОКАНИЕ',2,4,0],['ИКОНА',0,4,1],['ИНОКА',4,0,0]],
	[['АСКЕР',0,4,1],['ИСКРА',1,3,0],['КАРИЕС',3,0,0],['РИСКА',0,0,1]],
	[['КЛАРЕТ',4,3,0],['КАТЕР',0,6,1],['КАРЕЛ',0,4,1],['ТАЛЕР',2,0,0]],
	[['СТЕНКА',4,0,0],['СТЕНА',0,5,1],['СЕКТА',1,1,1],['СТЕКА',0,5,0]],
	[['АСКЕТ',0,3,1],['ТРЕСКА',4,3,0],['АРЕСТ',1,0,0],['ТРЕСК',0,7,1]],
	[['ПЕНАЛ',0,3,1],['ПЛЕНА',2,0,0],['ПЛАНЕР',4,2,0],['НЕРПА',0,0,0]],
	[['ЛЕПОТА',1,3,0],['ТЕПЛО',0,4,1],['ТОЛПА',0,6,1],['ОТПАЛ',3,0,0]],
	[['АРЕСТ',0,3,1],['СТРЕЛА',2,0,0],['ТАЛЕР',4,3,0],['ТАЛЕС',0,2,0]],
	[['МАНЕР',4,0,0],['МОРЕНА',0,2,1],['НОМЕР',0,4,1],['НОРМА',0,4,0]],
	[['МЕТАН',0,4,1],['РЕНТА',3,0,0],['МАРТЕН',0,4,0],['МАНЕР',1,2,1]],
	[['УРМАН',4,0,0],['МУРЕНА',0,4,1],['МУАРЕ',1,1,1],['МАНЕР',0,4,0]],
	[['СУРЕПА',1,3,0],['СУПЕР',0,4,1],['СУАРЕ',3,0,0],['ПАРУС',0,8,1]],
	[['НИЗКА',4,2,0],['ЗАКОН',0,2,1],['НИЗОК',0,0,0],['КАЗИНО',2,2,0]],
	[['КАРИОЗ',2,0,0],['РАЗОК',0,5,1],['КИРЗА',4,5,0],['ЗАРОК',0,3,0]],
	[['РАЗОК',0,3,1],['ЗАКОН',2,3,0],['НАРКОЗ',4,0,0],['КОРАН',0,1,0]],
	[['ТАНОК',0,5,1],['ЗНАТОК',4,0,0],['ОТКАЗ',0,4,0],['ЗАТОН',2,1,0]],
	[['ПОЛКА',0,4,1],['ПИЛКА',0,4,0],['КОПАЛ',0,7,1],['ПОИЛКА',3,0,0]],
	[['КАПЛИ',0,5,1],['ПЛИСКА',1,0,0],['ПИЛКА',4,4,0],['СИЛКА',0,2,1]],
	[['КАМИН',0,1,1],['ЯМИНА',2,0,0],['МАНИЯ',0,3,1],['ЯМИНКА',4,3,0]],
	[['ОСИНКА',0,0,0],['НОСИК',0,3,1],['ИКОНА',3,3,0],['САНКИ',0,1,1]],
	[['ИКОНА',0,3,1],['НИКТО',3,3,0],['ТОНИКА',0,0,0],['ТАНОК',0,0,1]],
	[['ПСИНА',4,0,0],['СПИНА',1,3,1],['СКНИПА',1,3,0],['СИНАП',0,6,1]],
	[['ПАРИК',0,4,1],['ПИРАТ',0,4,0],['ТАПИР',2,0,0],['КРИПТА',4,4,0]],
	[['ИСКРА',1,2,1],['РИСКА',2,0,0],['СТАРИК',0,4,1],['СИТАР',0,4,0]],
	[['ФИНАЛ',0,8,1],['НИМФА',3,4,0],['НАЛИМ',0,5,1],['ФЛАМИН',0,0,0]],
	[['ПЛИТА',4,0,0],['ТОЛПА',1,0,1],['ПИЛОТ',0,3,1],['ПОЛАТИ',0,3,0]],
	[['ФИРМА',2,4,0],['РИФМА',0,4,1],['ФИРМАН',0,6,1],['НИМФА',4,0,0]],
	[['СИТАР',1,5,1],['СПИРТ',1,5,0],['ТРИАС',0,8,1],['ПИАСТР',5,0,0]],
	[['КАПОТ',1,7,1],['ТОЛПА',3,4,0],['ПЛАТОК',0,4,1],['КОПАЛ',1,0,0]],
	[['ПОЛЯК',3,4,0],['ПОЛКА',0,8,1],['ОЛЯПКА',0,4,1],['ПЯЛКА',5,0,0]],
	[['РОМАН',5,2,0],['НАРКОМ',0,4,1],['КРОНА',3,4,0],['НОРМА',1,0,0]],
	[['ОКРАС',0,4,1],['КАПОР',2,0,0],['СПОРА',4,4,0],['ПРОСАК',0,8,1]],
	[['МОСОЛ',4,1,0],['МАСЛО',0,2,1],['ОСМОЛ',0,0,0],['СОЛОМА',2,2,0]],
	[['ТОЛПА',0,4,0],['ПЛАТО',0,7,1],['ОТПАЛ',0,5,1],['ПОРТАЛ',4,0,0]],
	[['РОМАН',1,1,1],['МОНАХ',2,0,0],['МОХНА',0,4,1],['МОНАРХ',0,4,0]],
	[['ДЕРБИ',0,5,1],['ДЕБРИ',0,5,0],['БРЕНД',0,7,1],['БРЕНДИ',4,0,0]],
	[['ДОБОР',2,1,0],['ПОБОР',0,3,1],['ДОБРО',4,0,0],['ПОДБОР',0,3,0]],
	[['ОБЛИК',4,0,0],['НОЛИК',0,4,1],['ЛОБИК',2,4,0],['БЛИНОК',0,1,0]],
	[['СОБОР',0,4,1],['КОРОБ',2,0,0],['ОБКОС',0,0,0],['БРОСОК',4,3,0]],
	[['СОБОР',0,0,0],['РОБОТ',0,4,1],['ТОРОС',4,4,0],['ОТБРОС',0,1,1]],
	[['ВОРОГ',5,0,0],['ОТРОГ',1,4,1],['ТВОРОГ',2,4,0],['ВОРОТ',0,7,1]],
	[['ВЕДРО',4,0,0],['ДРЕВО',0,4,1],['ВЕРЕД',0,2,1],['ДЕРЕВО',0,4,0]],
	[['СВОДИК',2,2,0],['СИВКО',0,3,1],['ВИСОК',0,1,0],['ВИДОК',4,0,0]],
	[['СЕВЕР',4,0,0],['ВЕРЕС',0,0,1],['СКВЕР',0,4,1],['ВЕРЕСК',2,4,0]],
	[['ОТВЕС',4,3,0],['СОВЕТ',0,4,1],['СЕЕВО',0,4,0],['СЕТЕВО',2,0,0]],
	[['РЕЗОН',0,3,1],['ЗВЕНО',2,3,0],['НЕРВОЗ',0,1,0],['ЗЕРНО',4,0,0]],
	[['НИКТО',0,4,1],['НОВИК',4,3,0],['ВИТОК',2,0,0],['ВИКОНТ',0,0,0]],
	[['КОЛОС',0,5,1],['СВОЛОК',0,0,0],['СОВОК',0,0,1],['ВОЛОС',2,3,0]],
	[['ВОРОТ',1,8,1],['РОПОТ',5,4,0],['ПОВТОР',0,4,1],['ПОРТО',1,0,0]],
	[['ПОДЛОГ',4,2,0],['ГОЛОД',0,4,1],['ПОДОГ',0,0,0],['ПОДОЛ',0,0,1]],
	[['ГОРОД',1,9,1],['РОНДО',4,5,0],['ДОНОР',0,5,1],['ГОРДОН',2,0,0]],
	[['ТЕУРГ',0,7,1],['ГУНТЕР',3,2,0],['ГРУНТ',0,4,1],['УНТЕР',1,0,0]],
	[['ПОЛОГ',1,4,1],['ПРОЛОГ',1,4,0],['ГОРЛО',0,6,1],['ПОРОГ',5,0,0]],
	[['ПРОГОН',0,3,0],['ПОРОГ',0,3,1],['ПОГОН',3,0,0],['ГОРНО',0,6,1]],
	[['ПОДМЕН',4,0,0],['ДОМЕН',1,4,1],['МОПЕД',0,2,1],['ДЕМОН',1,4,0]],
	[['ДЕМОН',2,5,0],['ОРДЕН',0,5,1],['МОДЕРН',4,0,0],['НОМЕР',0,4,0]],
	[['ПОМОЛ',0,5,1],['ПОДЛОМ',2,0,0],['ПОЛОМ',4,3,0],['ПОДОЛ',0,5,0]],
	[['ПОСОЛ',0,3,1],['ПОДОЛ',0,3,0],['ПОДСОЛ',2,0,0],['СОПЛО',4,0,0]],
	[['ТЕРНО',0,4,1],['РЕЗОН',2,4,0],['ТЕНЗОР',0,8,1],['ЗЕРНО',4,0,0]],
	[['СЕПИЯ',0,7,1],['ПЕНСИЯ',0,4,0],['ПЕСНЯ',0,4,1],['ПЕНИС',2,0,0]],
	[['СПИРЕЯ',4,0,0],['ПЕРСИ',0,2,1],['СЕРИЯ',0,5,1],['СЕПИЯ',0,5,0]],
	[['ЛЕСОК',0,5,1],['СЛЕПОК',4,0,0],['ПЕСОК',2,3,0],['СКЛЕП',0,3,0]],
	[['ПОКЕР',0,4,1],['СЕРКО',1,0,0],['ПРЕКОС',4,3,0],['ПЕСОК',1,7,1]],
	[['СПЕКТР',0,4,1],['КРЕСТ',2,2,0],['ПЕРСТ',4,0,0],['СКРЕП',0,4,0]],
	[['МЕНТОР',0,3,0],['МЕТРО',0,3,1],['ТЕРНО',2,3,0],['ТЕНОР',4,0,0]],
	[['ТУРНЕ',0,4,1],['УТРЕНЯ',3,0,0],['УНТЕР',1,4,0],['УТЕРЯ',0,2,1]],
	[['КОЗНИ',1,8,1],['НИКТО',2,4,0],['ЗОНТИК',0,4,1],['ТОНИК',5,0,0]],
	[['НОСИК',4,0,0],['СОМИК',0,4,1],['ОНИКС',0,2,1],['СНИМОК',0,4,0]],
	[['ТУПИК',0,2,1],['ТИПУН',2,0,0],['ПУНКТ',0,4,1],['ПУТНИК',0,4,0]],
	[['КОПИР',0,3,1],['КОРПИЯ',1,2,0],['ПИРОК',0,6,1],['КОПИЯ',3,0,0]],
	[['ПРОСТИ',3,0,0],['СИТРО',0,1,1],['ПОТИР',0,5,1],['СПОРТ',0,4,0]],
	[['СПИРТ',1,4,0],['СПУРТ',0,5,1],['РИПУС',1,7,1],['ПУРИСТ',4,0,0]],
	[['ЛОКУС',5,0,0],['КОНУС',1,4,1],['КОНСУЛ',2,3,0],['СКЛОН',0,8,1]],
	[['ПОРОК',4,0,0],['ПОЛОК',0,4,1],['ОКРОЛ',2,0,0],['ПРОКОЛ',0,4,0]],
	[['ПОЛОК',4,3,0],['ХОЛОП',0,3,1],['ХЛОПОК',2,2,0],['ПЛОХО',0,0,0]],
	[['МОТОК',0,5,1],['МОТОР',2,3,0],['МОРОК',0,7,1],['ОТКОРМ',0,0,0]],
	[['ПОРОК',1,7,1],['СОРОК',4,4,0],['ОПРОС',0,4,1],['СПОРОК',0,0,0]],
	[['ПРОТОК',0,1,1],['ПОРОК',4,0,0],['ОТРОК',0,4,1],['РОТОК',2,4,0]],
	[['ПОМОР',4,1,0],['ПОЛОМ',0,3,1],['ПРОЛОМ',2,0,0],['ПОМОЛ',0,3,0]],
	[['СОПЛО',4,0,0],['ПРОСО',0,1,1],['ПОСОЛ',0,3,1],['ПРОСОЛ',0,3,0]],
	[['ХОЛОП',0,5,1],['ПОСОЛ',2,1,0],['СПОЛОХ',0,0,0],['СОПЛО',4,3,0]],
	[['ОПРОС',1,2,1],['ПРОСО',4,0,0],['ПРОНОС',0,4,1],['ПОНОС',0,4,0]],
	[['ПРОТОН',4,2,0],['ОТПОР',0,3,1],['РОПОТ',2,1,0],['ТОПОР',0,0,0]],
	[['ОТПОР',0,5,1],['СТРОП',2,1,0],['СТОПОР',4,0,0],['ПОРТО',0,4,0]],
	[['БАНКА',3,3,0],['БАЛКА',0,6,1],['НАКАЛ',0,4,1],['ЛАНКА',1,0,0],['КАНАЛ',0,1,1]],
	[['НАКАТ',0,4,1],['ТАБАК',1,3,0],['НАБАТ',4,0,0],['АКАНТ',0,7,1],['ТАНКА',0,1,1]],
	[['БАКУН',0,4,1],['НАУКА',4,4,0],['БУКАН',1,8,1],['БАНКА',1,0,0],['КАБАН',1,6,0]],
	[['ОТВАР',1,3,1],['АВТОР',4,3,0],['ТОВАР',0,7,1],['ВРАТА',0,4,0],['РВОТА',2,0,0]],
	[['КАЗАН',2,0,0],['НАКАТ',1,1,1],['КАНАТ',0,4,1],['ТАНКА',4,4,0],['ЗАКАТ',0,2,0]],
	[['ПЛАТО',0,6,1],['ТОЛПА',1,4,0],['ОТПАЛ',0,4,1],['ЛАПТА',0,8,1],['ПЛАТА',3,0,0]],
	[['НАЛОГ',0,8,1],['ВОЛГА',1,4,0],['ВОЛНА',1,4,1],['ВОЛАН',4,0,0],['ВАГОН',1,1,1]],
	[['ОТВАР',0,0,1],['ТАВРО',1,0,0],['ТОВАР',0,4,1],['РВОТА',4,4,0],['АВТОР',0,2,1]],
	[['ВТОРА',1,0,0],['ВОРОТ',1,0,1],['ТОВАР',0,2,1],['АВТОР',1,4,1],['ТАВРО',3,4,0]],
	[['ОТВАР',2,4,0],['ТАВРО',1,7,1],['ТРОПА',0,4,1],['ПОВАР',5,6,0],['ВТОРА',4,0,0]],
	[['ВТОРА',0,4,1],['АВТОР',0,3,0],['ОТВАР',0,6,1],['РВОТА',4,0,0],['ТОВАР',0,0,1]],
	[['ДАРТС',1,3,1],['АДРЕС',2,3,0],['РДЕСТ',0,6,1],['СРЕДА',0,5,0],['АРЕСТ',5,0,0]],
	[['АСКЕР',0,0,1],['СТЕКА',1,0,0],['АРЕСТ',1,4,1],['КРЕСТ',3,2,0],['ТЕСАК',5,4,0]],
	[['ПЯЛКА',4,0,0],['МЯЛКА',0,4,1],['ПЛАМЯ',0,1,1],['ЛЯМКА',1,3,0],['КАПЛЯ',0,7,1]],
	[['ЛОГОС',1,4,1],['СОПЛО',4,0,0],['ГОЛОС',2,3,0],['ПОСОЛ',0,7,1],['ПОЛОГ',0,7,0]],
	[['ХОЛОП',0,6,1],['ХОЛОД',0,6,0],['ПОДОЛ',3,3,0],['ПОХОД',0,4,1],['ПЛОХО',1,0,0]],
	[['ПОЗОР',2,4,0],['РОПОТ',1,7,1],['ОТПОР',0,4,1],['ТОПОР',5,7,0],['ПОРТО',0,0,0]],
	[['СОПЛО',0,3,1],['ПОСОЛ',4,0,0],['ОСМОЛ',1,3,0],['МОСОЛ',0,6,1],['ПОЛОМ',3,5,0]],
	[['ХОЛОП',0,3,1],['СОПЛО',2,0,0],['ПОСОЛ',0,0,1],['ПЛОХО',4,3,0],['ПОСОХ',0,6,1]],

]


function time_str(){	
	return (new Date()).toLocaleString('ru-RU');	
	
}

fbs_once=async function(path){
	const info=await fbs.ref(path).once('value');
	return info.val();	
}

irnd = function(min,max) {	
    min = Math.ceil(min);
    max = Math.floor(max);
    return Math.floor(Math.random() * (max - min + 1)) + min;
}

//инициируем файербейс
firebase.initializeApp({			
	apiKey: "AIzaSyDs76rLdiq2ouIfQwT_vLff-vYGdyeOLqw",
	authDomain: "word-connect-88656.firebaseapp.com",
	databaseURL: "https://word-connect-88656-default-rtdb.europe-west1.firebasedatabase.app",
	projectId: "word-connect-88656",
	storageBucket: "word-connect-88656.appspot.com",
	messagingSenderId: "783317843458",
	appId: "1:783317843458:web:5d6783ea5cc0a31b9db11b"
});

//короткое обращение к базе данных
const fbs=firebase.database();

room1={
	
	
	quiz_data:'',
	resolver:0,
	cur_words:[],
	uid_data:{},
	activity_checker:0,
	last_activity_tm:0,
	start_tm:0,
	
	players_events(data){		
		
		console.log(data);
		if (!data) return;
		if (data.solved_num===this.cur_words.length){
			fbs.ref('room1/events').set({event:'WINNER',uid:data.uid, tm:Date.now()});
			console.log('Победитель: ',data.uid);
			this.resolver();
		}else{
			this.last_activity_tm=Date.now();
			fbs.ref('room1/events').set({event:'PROGRESS',uid:data.uid,solved_num:data.solved_num,tm:Date.now()});
		}		
		
	},
			
			
	check_activity(){
		
		const tm=Date.now();
		if (tm-this.last_activity_tm>40000){
			fbs.ref('room1/events').set({event:'HINT',tm:Date.now()});
			this.last_activity_tm=tm;
		}
		
	},
			
	async process(){
		
		
		fbs.ref('room1/players_events').remove();
		
		fbs.ref('room1/players_events').on('value',function(data){			
			room1.players_events(data.val())
		})
		
		
		while(1){
						
			
			//получаем текущее время
			await fbs.ref('tm').set(firebase.database.ServerValue.TIMESTAMP);
			await new Promise(resolve=>setTimeout(resolve, 1000));
			const tm=await fbs_once('tm');
			
			//удаляем старых игроков
			const uids=await fbs_once('room1/players');
			const num_of_players=Object.keys(uids||{}).length;			
			for(uid in uids){				
				if (tm-uids[uid]>100000)
					fbs.ref('room1/players/'+uid).remove();
			}
			
						
			await new Promise(resolve=>setTimeout(resolve, 5000));	
			fbs.ref('room1/events').set({event:'PREPARE',num_of_players, tm:Date.now()});
			await new Promise(resolve=>setTimeout(resolve, 2500));	
			
			
			//выбираем случайный кроссворд
			this.quiz_data=quiz_data[irnd(0,quiz_data.length-1)];
			this.cur_words={};
			this.quiz_data.forEach(q=>{this.cur_words[q[0]]=0})
			this.cur_words=this.quiz_data.map(v=>[v[0],0]);
			fbs.ref('room1/new_cw').set({event:'NEW_CW',quiz_data:this.quiz_data, tm:Date.now()});
			console.log('Начинаем игру!')
			
			this.start_tm=Date.now();
			this.last_activity_tm=this.start_tm;
			this.activity_checker=setInterval(function(){room1.check_activity()},3000);
			
			//ждем завершения раунда
			await new Promise(resolve=>this.resolver=resolve);
			clearInterval(this.activity_checker);
			console.log('раунд завершен!')
							
			
		}		
		
		
	}
		
	
}








